{
    "meals": ["Lunch", "Dinner", "Dessert", "Snack", "Appetizer", "Entree", "Soup", "Salad"],
    "navbar": {
        "home": "Home",
        "about": "About",
        "contribute": "Contribute",
        "language": "Language",
        "share": "Share"
    },
    "home": {
        "subtitle": "Tasty home made recipes",
        "search": "Search",
        "errorMessage": {
            "searchError": "It seems that there is no recipe with the title",
            "filterError": "It seems that there is no recipe of that type",
            "buttons": {
                "lastRecipes": "Last recipes",
                "addRecipe": "Add Recipe",
                "viewMore": "View More"
            }
        }
    },
    "recipe": {
        "ingredients": "Ingredients",
        "time": "Time",
        "people": "People",
        "advices": "Advices",
        "steps": "Steps",
        "buttons": {
            "download": "Download",
            "share": "Share"
        }
    },
    "submit": {
        "fullText": "<h1>Contributing</h1><p>Delici🥘us is an <a href='https://github.com/reymon359/delicious' target='_blank'>open source </a> <b>recipes</b> project and the more it has the better! so feel free to submit your own recipes to it😄</p><h3>I am thinking of adding a recipe</h3><p>First off, thank you for considering to submit a new recipe. It's people like you that make Delici🥘us such a great site.</p><h3>So how do I add my recipe?</h3><p>All the recipes are in the <a href='https://github.com/reymon359/delicious/blob/master/src/app/services/recipes.ts' target='_blank'>recipes.ts file</a> in an array of recipes. So you just have to submit a <b>pull request</b> with your recipeadded to the array. If you do not know what an array or pull request is I am planning to add some way to submit recipes for non programming people.</p><h3>What kind of recipes can I submit?</h3><p>You can submit any kind of recipe you want! Just do not forget to label it right according to the <b>meal</b> it is. For example a chocolate cake would be a <b>Dessert</b> not a <b>Salad</b>. To learn more about how to structure a recipe lookat the<a href='https://github.com/reymon359/delicious/blob/master/src/app/services/recipe.ts' target='_blank'>recipe class</a> and the array of recipes ini the <a href='https://github.com/reymon359/delicious/blob/master/src/app/services/recipes.ts'target='_blank'>recipes.ts file</a> to see some examples.</p><h3>Other contributtions</h3><p>Delici🥘us is an open source project and we love to receive contributions from our community — you! There are other ways to contribute appart from submitting recipes like submitting bug reports and feature requests or writing code which canbe incorporated into Delici🥘us itself.</p><h3>Some expectations for behavior.</h3><p>This includes not just how to <b>communicate with others</b> (being respectful, considerate, etc) but also <b>technical responsibilities</b> (importance of testing, project dependencies, etc).</p><h1>Your First Contribution</h1><p>Unsure where to begin contributing to Delici🥘us? Here are a couple of friendly tutorials that can help you: <a href='http://makeapullrequest.com/' target='_blank'>http://makeapullrequest.com</a> and <a href='http://www.firsttimersonly.com/'target='_blank'>http://www.firsttimersonly.com</a>. Also if you are working on your first Pull Request you can learn how from this <em>free</em> series, <a href='https://egghead.io/series/how-to-contribute-to-an-open-source-project-on-github'>How to Contribute to an Open Source Project on GitHub</a>.</p><p>At this point, you're ready to submit your recipe! Feel free to ask for help; everyone is a beginner at first. </p><p>For something that is bigger than a one or two line fix:</p><ol><li>Create your own fork of the code</li><li>Do the changes in your fork</li><li>If you like the change and think the project could use it send a pull request indicating that you have a CLA on file.</li></ol><p>Small contributions such as fixing spelling errors, where the content is small enough to not be considered intellectual property, can be submitted by a contributor as a patch, without a CLA.</p><p>As a rule of thumb, changes are obvious fixes if they do not introduce any new functionality or creative thinking. As long as the change does not affect functionality, some likely examples include the following:</p><ul><li>Spelling / grammar fixes</li><li>Typo correction, white space and formatting changes</li><li>Comment clean up</li><li>Bug fixes that change default return values or error codes stored in constants</li><li>Adding logging messages or debugging output</li><li>Changes to ‘metadata’ files like Gemfile, .gitignore, build scripts, etc.</li><li>Moving source files from one directory or package to another</li></ul><h3>How to report a bug</h3><p>If you find a security vulnerability, do NOT open an issue. Email me ramonmorcillodev@gmail.com instead.</p><h3>How to suggest a feature or enhancement</h3><p>The Delici🥘us philosophy is to be a site where, at first, developers can add and see their recipes. If you find yourself wishing for a feature that doesn't exist in Delici🥘us, you are probably not alone. There are bound to be others outthere with similar needs. Many of the features that Delici🥘us has today have been added because our users saw the need. Open an issue on our issues list on GitHub which describes the feature you would like to see, why you need it,and how it should work.</p>"
    },
    "about": {
        "fullText":"<h1 class='display-2'>Delici<img src='./assets/img/icons/paella-icon.png' width='70px' alt=''>us</h1><h4>v.1.0.0</h4><p>Personal project about recipes made with 💙 in my spare time. </p><p>If you want to contact me just send me a mail to <a href='mailto:ramonmorcillodev@gmail.com?Subject=Hello%20Ramon' target='_top'>ramonmorcillodev@gmail.com</a> </p><a href='https://github.com/reymon359/delicious' target='_blank'>Link to the github repo</a><br><a href='https://ramonmorcillo.com' target='_blank'>My site with other projects</a>"
    }
}