{
    "meals": ["Comida", "Cena", "Postre", "Almuerzo", "Aperitivo", "Entrante", "Sopa", "Ensalada"],
    "navbar": {
        "home": "Inicio",
        "about": "Acerca",
        "contribute": "Contribuir",
        "language": "Idioma",
        "share": "Compartir"
    },
    "home": {
        "subtitle": "Sabrosas recetas caseras",
        "search": "B칰squeda",
        "errorMessage": {
            "searchError": "Parece que no hay ninguna receta con el t칤tulo",
            "filterError": "Parece que no hay ninguna receta de ese tipo",
            "buttons": {
                "lastRecipes": "칔ltimas recetas",
                "addRecipe": "A침adir Receta",
                "viewMore": "Ver M치s"
            }
        }
    },
    "recipe": {
        "ingredients": "Ingredientes",
        "time": "Tiempo",
        "people": "Personas",
        "advices": "Consejos",
        "steps": "Pasos",
        "buttons": {
            "download": "Descargar",
            "share": "Compartir"
        }
    },
    "submit": {
        "fullText": "<h1>Contribuir</h1><p>Delici游볮us es un projecto de <a href='https://github.com/reymon359/delicious' target='_blank'>c칩digo abierto </a> de <b>recipes</b> y cuantas ma치s tenga mejor! Asi que sientet칠 libre de a침adir tus propias recetas游땏</p><h3>Estoy pensando en a침adir una receta</h3><p>Lo primero, agradecerte el considerar a침adir una nueva receta. Es gracias a gente como tu que haceis de Delici游볮us un gran sitio.</p><h3>쮼ntonces como a침ado mi receta?</h3><p>Todas las recetas est치n en el archivo <a href='https://github.com/reymon359/delicious/blob/master/src/app/services/recipes.ts' target='_blank'>recipes.ts</a> dentro de un array de recetas. Asi que solo tienes que crear un <b>pull request</b> con tu receta a침adida al array. Si no sabes lo que es un array o un pull request estoy planeando en crear alg칰n modo de a침adir recetas para gente que no entiende de programaci칩n.</p><h3>쯈ue tipo de recetas puedo subir?</h3><p>춰
        Puedes enviar cualquier tipo de receta que quieras!Simplemente no olvides etiquetarlo de acuerdo con la < b > comida < /b> que es. Por ejemplo, un pastel de chocolate ser칤a un <b>Postre</b > ,
        no una < b > Ensalada < /b>. Para obtener m치s informaci칩n sobre c칩mo estructurar una receta de echa un ojo a la <a href='https:/ / github.com / reymon359 / delicious / blob / master / src / app / services / recipe.ts ' target='
        _blank '>clase de receta</a> y al array de recetas en el archivo <a href='
        https: //github.com/reymon359/delicious/blob/master/src/app/services/recipes.ts'target='_blank'>recipes.ts</a> para ver algunos ejemplos.</p>
            <
            h3 > Otras contribuciones < /h3><p>Delici游볮us es un proyecto de c칩digo abierto y nos encanta recibir contribuciones de nuestra comunidad: 춰t칰! Hay otras formas de contribuir, adem치s de enviar recetas, como enviar informes de errores y solicitudes de caracter칤sticas o escribir c칩digo que se puede incorporar en Delici游볮us..</p >
            <
            h3 > Algunas expectativas de comportamiento < /h3><p>Esto incluye no solo c칩mo comunicarse con los dem치s (ser respetuoso, considerado, etc.) sino tambi칠n responsabilidades t칠cnicas (importancia de las pruebas, dependencias del proyecto, etc.).</p >
            <
            h1 > Tu primera contribuci칩n < /h1><p>쯅o est치s seguro de d칩nde comenzar a contribuir a Delici游볮us? Aqu칤 hay un par de tutoriales amigables que pueden ayudarte: <a href='http:/ / makeapullrequest.com / ' target='
        _blank '>http://makeapullrequest.com</a> y <a href='
        http: //www.firsttimersonly.com/'target='_blank'>http://www.firsttimersonly.com</a>. Adem치s, si estas trabajando en tu primer pull request, puedes aprender c칩mo de esta serie gratuita, <a href='https://egghead.io/series/how-to-contribute-to-an-open-source-project-on-github'>How to Contribute to an Open Source Project on GitHub</a>.
            <
            /p><p>En este punto, 춰est치s listo para enviar tu receta! Si칠ntase libre de pedir ayuda; todos son principiantes al principio</p >
            <
            p > Para algo que es m치s grande que una correcci칩n de una o dos l칤neas: < /p><ol><li>Crea tu propio fork del c칩digo</li >
            <
            li > Haz los cambios en tu fork < /li><li>Si le gusta el cambio y cree que el proyecto podr칤a usarlo, env칤e una solicitud de extracci칩n que indique que tiene un CLA en el archivo.</li >
            <
            /ol><p>Las contribuciones peque침as, como la correcci칩n de errores ortogr치ficos, donde el contenido es lo suficientemente peque침o como para no ser considerado propiedad intelectual, pueden ser enviadas por un contribuyente como un parche, sin un CLA.</p >
            <
            p > Como regla general,
        los cambios son soluciones obvias si no introducen ninguna funcionalidad nueva o pensamiento creativo.Mientras el cambio no afecte la funcionalidad,
        algunos ejemplos probables incluyen los siguientes: < /p> <
            ul > < li > Correcci칩n ortogr치fica / gramatical < /li><li>Correcci칩n de errores tipogr치ficos, espacios en blanco y cambios de formato</li >
            <
            li > Limpieza de comentarios < /li><li>Correcci칩n de errores que cambian los valores de retorno por defecto</li > < li > Agregar mensajes de registro o salida de depuraci칩n < /li> <
            li > Cambios en archivos de metadatos como Gemfile,
        .gitignore,
        scripts de compilaci칩n,
        etc. < /li><li>Mover archivos de origen de un directorio o paquete a otro</li > < /ul> <
        h3 > C칩mo reportar un error < /h3><p>If you find a security vulnerability, do NOT open an issue. Email me ramonmorcillodev@gmail.com instead.</p > < h3 > How to suggest a feature or enhancement < /h3><p>The Delici游볮us philosophy is to be a site where, at first, developers can add and see their recipes. If you find yourself wishing for a feature that doesn't exist in Delici游볮us, you are probably not alone. There are bound to be others outthere with similar needs. Many of the features that Elasticsearch has today have been added because our users saw the need. Open an issue on our issues list on GitHub which describes the feature you would like to see, why you need it,and how it should work.</p > "
    }
}